1.Load the "titanic" dataset and display the first 5 rows.

In [8]:
import pandas as pd

# Load the dataset
tit = pd.read_csv("Titanic-Dataset.csv")

# Display the first 5 rows of the dataset
print(tit.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

2.How many passengers were in first class (Pclass=1) in the titanic dataset?

In [19]:
import pandas as pd 

tit = pd.read_csv("Titanic-Dataset.csv")

first_class_passengers = tit[tit["Pclass"]== 1].shape[0]
print("number of passengers in the first class : ",first_class_passengers)

number of passengers in the first class :  216

3.Create a new column in the titanic dataset called "is_alone" which should be True if a passenger has no siblings/spouses or parents/children on board and False otherwise.

In [20]:
import pandas as pd 

tit = pd.read_csv("Titanic-Dataset.csv")

tit["is_alone"] = (tit["SibSp"] == 0) & (tit["Parch"] == 0)

print(tit.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  is_alone
0      0         A/5 21171   7.2500   NaN        S     False
1      0          PC 17599  71.2833   C85        C     False
2      0  STON/O2. 3101282   7.9250   NaN        S      True
3      0            113803  53.1000  C123        S     False
4      0            373450   8.0500   NaN        S      True

4.Group the titanic dataset by "Pclass" and calculate the mean "Age" for each class.

In [21]:
import pandas as pd 

tit = pd.read_csv("Titanic-Dataset.csv")

mean_age_by_pclass = tit.groupby('Pclass')['Age'].mean()
print(mean_age_by_pclass)

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

5.Sort the titanic dataset by "Fare" in descending order and display the first 10 rows.

In [3]:
import pandas as pd 

tit = pd.read_csv("Titanic-Dataset.csv")

tit_sorted = tit.sort_values(by='Fare', ascending = False)
print(tit_sorted.head(10))

     PassengerId  Survived  Pclass                                   Name  \
258          259         1       1                       Ward, Miss. Anna
737          738         1       1                 Lesurer, Mr. Gustave J
679          680         1       1     Cardeza, Mr. Thomas Drake Martinez
88            89         1       1             Fortune, Miss. Mabel Helen
27            28         0       1         Fortune, Mr. Charles Alexander
341          342         1       1         Fortune, Miss. Alice Elizabeth
438          439         0       1                      Fortune, Mr. Mark
311          312         1       1             Ryerson, Miss. Emily Borie
742          743         1       1  Ryerson, Miss. Susan Parker "Suzette"
118          119         0       1               Baxter, Mr. Quigg Edmond

        Sex   Age  SibSp  Parch    Ticket      Fare            Cabin Embarked
258  female  35.0      0      0  PC 17755  512.3292              NaN        C
737    male  35.0      0      0  PC 17755  512.3292             B101        C
679    male  36.0      0      1  PC 17755  512.3292      B51 B53 B55        C
88   female  23.0      3      2     19950  263.0000      C23 C25 C27        S
27     male  19.0      3      2     19950  263.0000      C23 C25 C27        S
341  female  24.0      3      2     19950  263.0000      C23 C25 C27        S
438    male  64.0      1      4     19950  263.0000      C23 C25 C27        S
311  female  18.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
742  female  21.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
118    male  24.0      0      1  PC 17558  247.5208          B58 B60        C

6.Create a new column in the titanic dataset called "fare_category" which should have the value "cheap" if the fare is less than 10, "moderate" if the fare is between 10 and 50, and "expensive" if the fare is greater than 50.

In [9]:
import pandas as pd

# Load your Titanic dataset
titanic = pd.read_csv("Titanic-Dataset.csv")

# Create the 'fare_category' column
titanic['fare_category'] = pd.cut(titanic_df['Fare'],
                                      bins=[-1, 10, 50, float('inf')],
                                      labels=['cheap', 'moderate', 'expensive'],
                                      include_lowest=True)

# Check the first few rows to confirm the new column is added
print(titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked fare_category
0      0         A/5 21171   7.2500   NaN        S         cheap
1      0          PC 17599  71.2833   C85        C     expensive
2      0  STON/O2. 3101282   7.9250   NaN        S         cheap
3      0            113803  53.1000  C123        S     expensive
4      0            373450   8.0500   NaN        S         cheap

7.Filter the titanic dataset to only include passengers who are male and survived.

In [12]:
import pandas as pd 
titanic = pd.read_csv("Titanic-Dataset.csv")
male_survivors = titanic[(titanic["Sex"]=="male")&(titanic["Survived"] == 1)]

print(male_survivors.head())

    PassengerId  Survived  Pclass                          Name   Sex   Age  \
17           18         1       2  Williams, Mr. Charles Eugene  male   NaN
21           22         1       2         Beesley, Mr. Lawrence  male  34.0
23           24         1       1  Sloper, Mr. William Thompson  male  28.0
36           37         1       3              Mamee, Mr. Hanna  male   NaN
55           56         1       1             Woolner, Mr. Hugh  male   NaN

    SibSp  Parch  Ticket     Fare Cabin Embarked
17      0      0  244373  13.0000   NaN        S
21      0      0  248698  13.0000   D56        S
23      0      0  113788  35.5000    A6        S
36      0      0    2677   7.2292   NaN        C
55      0      0   19947  35.5000   C52        S

8.Drop the "Cabin" column from the titanic dataset

In [13]:
import pandas as pd

titanic = pd.read_csv("Titanic-Dataset.csv")

titanic.drop("Cabin",axis =1,inplace =True)

print(titanic.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Embarked
0      0         A/5 21171   7.2500        S
1      0          PC 17599  71.2833        C
2      0  STON/O2. 3101282   7.9250        S
3      0            113803  53.1000        S
4      0            373450   8.0500        S